tap "atlassian/cloudtoken", "git@bitbucket.org:atlassian/cloudtoken-homebrew-tap.git"
tap "go-task/tap"
tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "lucagrulla/tap"
tap "ngrok/ngrok"
tap "snyk/tap"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Collection of portable C++ source libraries
brew "boost"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Tool for exploring each layer in a docker image
brew "dive"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Modern, maintained replacement for ls
brew "eza"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Image manipulation
brew "netpbm"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Text-based UI library
brew "ncurses"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Node version management
brew "n"
# Libraries for security-enabled client and server applications
brew "nss"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Python version management
brew "pyenv"
# Safe, concurrent, practical language
brew "rust"
# Tool for building source and injecting into docker images
brew "source-to-image"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# UNIX shell (command interpreter)
brew "zsh"
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
# Find & fix known vulnerabilities in open-source dependencies
brew "snyk/tap/snyk"
# Chromium based browser
cask "arc"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
# Web browser
cask "google-chrome@canary"
# Client for the Google Drive storage service
cask "google-drive"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Collaboration platform for API development
cask "postman"
# Video chat, voice call and instant messaging application
cask "skype"
# Graphical client for Git version control
cask "sourcetree"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"