tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# Distributed revision control system
brew "git", link: false
# Git extension for versioning large files
brew "git-lfs"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Text-based UI library
brew "ncurses"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Node version management
brew "n"
# Perl compatible regular expressions library
brew "pcre"
# Watch files and take action when they change
brew "watchman"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# Application launcher and productivity software
cask "alfred"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Web browser
cask "google-chrome-canary"
# Client for the Google Drive storage service
cask "google-drive"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# App to write, plan, collaborate, and get organized
cask "notion"
# Collaboration platform for API development
cask "postman"
# Video chat, voice call and instant messaging application
cask "skype"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Open-source code editor
cask "visual-studio-code"
# Desktop client for WhatsApp
cask "whatsapp"
mas "DaisyDisk", id: 411643860
mas "Delay-Start", id: 591620786
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Owly", id: 882812218
mas "Pages", id: 409201541
